// Напиши скрипт управління особистим кабінетом інтернет банку
//Є об'єкт account у якому необхідно реалізувати
//методи для роботи з балансом та історією транзакцій

// Типів транзакцій лише два.
// Можна покласти або зняти гроші з рахунку
const Transaction = {
    DEPOSIT: "deposit",
    WITHDRAW: "withdraw",
  };
  
  //Кожна транзакція це об'єкт з властивостямиЖ id, type, amount
  
  const account = {
    //поточний баланс рахунку
    balance: 0,
  
    // Історія транзакцій
    transactions: [],
  
    //Метод створює та повертає об'єкт транзакцій
    //Приймає суму та тип транзакцій
    createTransaction(type, amount) {
      return {
        type,
        amount,
      };
    },
  
    //Метод відповідає за додавання суми до балансу.
    //Приймає суму транкціонації.
    //Викликає createTransaction для створення об'єкта транзакції
    //після чого додає їх у історію транзакцій
      deposit(amount) {
          const newTransaction = this.createTransaction(Transaction.DEPOSIT, amount);
          this.transactions.push(newTransaction);
          this.balance += amount;
    },
  
    //Метод відповідає за зняття суми з балансу.
    //Приймає суму транкціонації.
    //Викликає createTransaction для створення об'єкта транзакції
    //після чого додає їх у історію транзакцій
    //Якщо amount більше ніж поточний баланс, виводимо повідомлення про те,
    //що недостатньо коштів на рахунку
    withdraw(amount) {},
  
    //Метод повертає поточний баланс
    getBalance() {},
  
    //Метод шукає та повертає об'єкт транзакції по id
    getTransactionDetails(id) {},
  
    //Метод повертає кількість засобів певного типу
    //транзакції з історії транзакцій
    getTransactionType(type) {},
  };
  